---
kind: method
id: M:Autodesk.Revit.DB.TableData.GetSectionData(System.Int32)
source: html/ac5594a4-3b6e-9a85-ac7c-363340f09aac.htm
---
# Autodesk.Revit.DB.TableData.GetSectionData Method

Returns the section data array element at the specified index.

## Syntax (C#)
```csharp
public TableSectionData GetSectionData(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`) - The index of section data array. If the index is out of the boundary of section data array,
 Nothing nullptr a null reference ( Nothing in Visual Basic) is returned.